{"linksArray":[{"name":"LinkedIn","href":"https://www.linkedin.com/in/skullyflower","extra":["With over 10 years of experience in front-end development, I bring expertise in React, Node.js, and crafting scalable SaaS applications.","Go to LinkedIn to learn more about my connections, and qualifications."]},{"name":"GitHub","href":"https://www.github.com/skullyflower","extra":["Personal account that houses my experiments.","Go to Github and see my code for this site, my JSON File Editor electron app, the RARR Recovery (site and electron app),  and more."]},{"name":"Resumé","href":"/DragonMessmerwebResume.pdf","extra":["(Dec. 2023 to present) Equity Prime Mortgage - Senior Software Engineer (Dec. 2023 to present)","(Feb. 2018 to Jul. 2023) Home Point Financial Corporation - Senior Software Engineer ","(Jan. 2012 to Feb. 2018) UniteU - Staff Technologist "]},{"name":"EPMX","href":"https://epmexperience.com","extra":["Professional Project: Mortgage Portal","( React, Typescript,  Redux, Node, Express, MongoDB) Highly configurable, mortgage broker facing, portal to encompass.","I've created a lot of the CMS capabilities of the application allowing for the creation and maintenance of the searchable, in-app, help links. "]},{"name":"RARR Recovery","href":"https://rarr-recovery.org","extra":["Fun, useful 12 step recovery site.","(React, Typescript, Chakra) Site, still in development, for Ragers and Rampagers Recovering, a fictitious 12 step program, with real 10th step, spot check, inventory forms. Results can be copied and sent to an accountability buddy.","The monster recovery theme came from a comic I self published.","Desktop app (Electron) is coming soon!"]},{"name":"SkullyFlower","href":"https://www.skullyflower.com","extra":["My personal art site.","For almost 20 years, this has housed my personal brand. I have a lot of fun with it.","I coded my own database-less cart and gallery system, and a separate admin app, using node, to maintain the JSON files the site uses for data.","And it is haunted every Fall with various ghosts!","Over the years, as I new languages, tricks or frameworks, I've refactored the site. Currently, I am slowly reworking it to use TypeScript and zustand. I'm also moving the admin into it's own electron app."]}],"hiremeText":{"intro":"Experienced, purpose driven, front end focused, Sr. Software Engineer","visable":["I'm passionate about bringing excellent designs to life with real data. I work well within cross functional teams, boldly and tenaciously meeting the challenges of good UX design, difficult to realize requirements, and complex data manipulations. I have experience creating fully responsive sites from scratch with pure css, but am also comfortable working with UI frameworks, like Chakra or Bootstrap. I have a record of delighting impossible to please clients, and other stakeholders."],"hidden":["<blockquote>&ldquo;Dragon is a fantastic front-end developer who is an asset to every team she joins. She brings both deep technical knowledge and a willingness to jump in and help with anything. In fact, that customer focus/product mindset is one of her biggest strengths. She was often requested by name by our professional services customers because of her attention to detail and focus on helping the customer achieve their vision.&rdquo; - <i> <a href='https://www.linkedin.com/in/aaron-witt-1455783/' target='aaron' rel='noopener'> Aaron Witt, Enterprise Cloud Architect | Engineering Leader | DevOps Devotee</a></i></blockquote>","I am full-stack capable and adept at quickly learning new languages and frameworks, and have never held a purely front-end position. My experience spans from PHP to C# to Node.js, and from HTML and jQuery to modern libraries like React. I have worked with various databases, version control systems, and hosting environments, collaborating effectively within diverse teams. I am well-versed in agile methodologies and have comprehensive experience with the entire software development life cycle—ranging from requirements gathering and architecture design to deployment and ongoing maintenance.","While I wouldn't call myself a designer, I do work well with designers, not simply replicating static designs but transforming them into dynamic, responsive pieces of code that adapt seamlessly to different Zeplin and am highly comfortable with the process of bringing a design from concept to fully functional code.","In recent years, my career has led me into the mortgage industry, where I have been involved in creating, expanding, and maintaining mortgage portal, SaaS applications. While the challenges presented by these projects are intellectually engaging, I find myself missing the more visually dynamic and client-centered challenges that characterized my earlier career."]}}